rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL
---
  def matchingDirectors
	id = params[:id]
	@movie = Movie.find(id)
	@director = @movie["director"]
	if @director.nil? || @director.empty?
		redirect_to url_for(:controller => "movies", :action => "index", :movie => @movie[:title])
	else
		@movies= Movie.where(:director => @director)